In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
#字典转Series
data = {'Country':['Bel','Ind','Braz'],'Cap':['Bru','New','Bras'],
            'Pop':[11190846,1303171035,20787528]}

 Series

In [14]:
s1 = pd.Series(data['Country'],index=['A','B','ChildProcessError'])
s1

A                     Bel
B                     Ind
ChildProcessError    Braz
dtype: object

In [15]:
s1.values

array(['Bel', 'Ind', 'Braz'], dtype=object)

In [16]:
s1.index

Index(['A', 'B', 'ChildProcessError'], dtype='object')

DataFrame

In [18]:
#访问某一列
df1 = pd.DataFrame(data)
df1

  Country   Cap         Pop
0     Bel   Bru    11190846
1     Ind   New  1303171035
2    Braz  Bras    20787528

In [19]:
cou = df1['Country']
type(cou)

pandas.core.series.Series

In [20]:
df1.iterrows()

In [22]:
for row in df1.iterrows():
    print(row),print(type(row)),print(len(row))

(0, Country         Bel
Cap             Bru
Pop        11190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country           Ind
Cap               New
Pop        1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country        Braz
Cap            Bras
Pop        20787528
Name: 2, dtype: object)
<class 'tuple'>
2

In [23]:
#由多个Series创建dataFrame

In [29]:
s1 = pd.Series(data['Cap'])
s2 = pd.Series(data['Country'])
s3 = pd.Series(data['Pop'])
df_new = pd.DataFrame([s1,s2,s3],index=['Cap','Country','Pop'])
df_new

                0           1         2
Cap           Bru         New      Bras
Country       Bel         Ind      Braz
Pop      11190846  1303171035  20787528

In [30]:
df1

  Country   Cap         Pop
0     Bel   Bru    11190846
1     Ind   New  1303171035
2    Braz  Bras    20787528

In [31]:
#df_new 转过来
df_new.T

    Cap Country         Pop
0   Bru     Bel    11190846
1   New     Ind  1303171035
2  Bras    Braz    20787528